# test

In [2]:
import pandas as pd
import numpy as np
pd.set_option('max_rows', 5)

In [109]:
#basic

pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [110]:
#index
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [111]:
#series
pd.Series([1, 2, 3, 4, 5])
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

<!-- Reading data files -->

In [112]:
# read csv file

reviews = pd.read_csv("C:\/users/L/MyWork/pandas_tutorials/oscar_age_female.csv")
pd.set_option('max_rows', 5)
reviews.head()

,Index,Year,Age,Name,Movie,Unnamed: 5
0,1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
1,2,1929,37,"""Mary Pickford""","""Coquette""",NaN
2,3,1930,28,"""Norma Shearer""","""The Divorcee""\t",NaN
3,4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
4,5,1932,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN

In [113]:
reviews.iloc[0]

Index                                                        1
Year                                                      1928
                                    ...
Movie                                          "Seventh Heaven
Unnamed: 5     Street Angel and Sunrise: A Song of Two Humans"
Name: 0, Length: 6, dtype: object

In [114]:
reviews['Year']

0     1928
1     1929
      ...
87    2015
88    2016
Name: Year, Length: 89, dtype: int64

In [115]:
reviews['Year'][0]

1928

In [116]:
reviews.iloc[:, 2]

0     22
1     37
      ..
87    54
88    26
Name: Age, Length: 89, dtype: int64

In [117]:
reviews.iloc[[0, 1, 4], 4]

0                    "Seventh Heaven
1                         "Coquette"
4     "The Sin of Madelon Claudet"\t
Name: Movie, dtype: object

In [118]:
#조건주기

reviews.loc[(reviews.Year >= 2000) & (reviews.Age >= 30)]

    Index  Year  Age               Name               Movie Unnamed: 5
73     74  2001   33    "Julia Roberts"   "Erin Brockovich"        NaN
74     75  2002   35      "Halle Berry"    "Monster's Ball"        NaN
..    ...   ...  ...                ...                 ...        ...
86     87  2014   44   "Cate Blanchett"      "Blue Jasmine"        NaN
87     88  2015   54   "Julianne Moore"       "Still Alice"        NaN

[11 rows x 6 columns]

# 기타 조건활용 함수
<!-- 
reviews.loc[reviews.price.notnull()]
reviews.loc[reviews.country.isin(['Italy', 'France'])]
 -->

In [119]:
reviews['Year'] = 'everyone'
reviews.head()

,Index,Year,Age,Name,Movie,Unnamed: 5
0,1,everyone,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
1,2,everyone,37,"""Mary Pickford""","""Coquette""",NaN
2,3,everyone,28,"""Norma Shearer""","""The Divorcee""\t",NaN
3,4,everyone,63,"""Marie Dressler""","""Min and Bill""",NaN
4,5,everyone,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN

In [120]:
reviews.Age.describe()

count    89.000000
mean     36.123596
           ...
75%      41.000000
max      80.000000
Name: Age, Length: 8, dtype: float64

In [121]:
reviews.Age.mean()

36.12359550561798

In [122]:
reviews.Name.unique()

array([' "Janet Gaynor"', ' "Mary Pickford"', ' "Norma Shearer"',
       ' "Marie Dressler"', ' "Helen Hayes"', ' "Katharine Hepburn"',
       ' "Claudette Colbert"', ' "Bette Davis"', ' "Luise Rainer"',
       ' "Vivien Leigh"', ' "Ginger Rogers"', ' "Joan Fontaine"',
       ' "Greer Garson"', ' "Jennifer Jones"', ' "Ingrid Bergman"',
       ' "Joan Crawford"', ' "Olivia de Havilland"', ' "Loretta Young"',
       ' "Jane Wyman"', ' "Judy Holliday"', ' "Shirley Booth"',
       ' "Audrey Hepburn"', ' "Grace Kelly"', ' "Anna Magnani"',
       ' "Joanne Woodward"', ' "Susan Hayward"', ' "Simone Signoret"',
       ' "Elizabeth Taylor"', ' "Sophia Loren"', ' "Anne Bancroft"',
       ' "Patricia Neal"', ' "Julie Andrews"', ' "Julie Christie"',
       ' "Barbra Streisand"', ' "Maggie Smith"', ' "Glenda Jackson"',
       ' "Jane Fonda"', ' "Liza Minnelli"', ' "Ellen Burstyn"',
       ' "Louise Fletcher"', ' "Faye Dunaway"', ' "Diane Keaton"',
       ' "Sally Field"', ' "Sissy Spacek"', ' "Meryl Streep"',
       ' "Shirley MacLaine"', ' "Geraldine Page"', ' "Marlee Matlin"',
       ' "Cher"', ' "Jodie Foster"', ' "Jessica Tandy"', ' "Kathy Bates"',
       ' "Emma Thompson"', ' "Holly Hunter"', ' "Jessica Lange"',
       ' "Susan Sarandon"', ' "Frances McDormand"', ' "Helen Hunt"',
       ' "Gwyneth Paltrow"', ' "Hilary Swank"', ' "Julia Roberts"',
       ' "Halle Berry"', ' "Nicole Kidman"', ' "Charlize Theron"',
       ' "Reese Witherspoon"', ' "Helen Mirren"', ' "Marion Cotillard"',
       ' "Kate Winslet"', ' "Sandra Bullock"', ' "Natalie Portman"',
       ' "Jennifer Lawrence"', ' "Cate Blanchett"', ' "Julianne Moore"',
       ' "Brie Larson"'], dtype=object)

In [124]:
reviews.Name.value_counts()

 "Katharine Hepburn"    4
 "Luise Rainer"         2
                       ..
 "Ginger Rogers"        1
 "Helen Hunt"           1
Name: Name, Length: 74, dtype: int64

In [1]:
reviews.groupby('points').points.count()

NameError: name 'reviews' is not defined